Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCuttingSurfaceMakesMultipleCuts Property
 The surface-based splitter intersects a face to be divided in multiple places and this case is not currently supported
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCuttingSurfaceMakesMultipleCuts { get; }
Public Shared ReadOnly Property DividedSurfaceCuttingSurfaceMakesMultipleCuts As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCuttingSurfaceMakesMultipleCuts {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCuttingSurfaceMakesMultipleCuts : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace